In [1]:
import pandas as pd

In [2]:
student_data = [
    [1, 15],
    [2, 11],
    [3, 11],
    [4, 20]
]

In [3]:
df=pd.DataFrame(student_data,columns=["student_id","age"])
df

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

In [6]:
list(df.shape)

[4, 2]

In [7]:
data = {
    "student_id": [100, 101, 102, 103],
    "name": ["Alice", "Bob", "Charlie", "David"],
    "age": [15, 16, 14, 17]
}

In [8]:
students_df = pd.DataFrame(data)

In [9]:
#masking
students_df[students_df["student_id"]==101][["name","age"]]

  name  age
1  Bob   16

In [10]:
#Drop Duplicates
data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "email": ["alice@example.com", "bob@example.com", "charlie@example.com", "alice@example.com", "eve@example.com"]
}

In [12]:
customers_df = pd.DataFrame(data)
customers_df

      name                email
0    Alice    alice@example.com
1      Bob      bob@example.com
2  Charlie  charlie@example.com
3    David    alice@example.com
4      Eve      eve@example.com

In [14]:
#Drop Duplicates form only email subset and keeping only first
customers_df.drop_duplicates(subset="email", keep="first")

      name                email
0    Alice    alice@example.com
1      Bob      bob@example.com
2  Charlie  charlie@example.com
4      Eve      eve@example.com

#### pd.concat([df1,df2],ignore_index=True/False) for concating the two dataframe verically

#### df.pivot_table(index=["Groupby_RowNames"],Columns="ColumnName",Values="Value")

#### df.melt(id_vars="",var_name="",value_name="") for reshaping dataframe

#### df.sort_values(by="",ascending=True/False)